### 1. Import pandas and read the data into a DataFrame. Print the first 5 rows of the DataFrame.

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('E:\Pradeep_Datascience\Github_files\padas_question.csv')

In [3]:
df

      Name  Gender  Age  Height (cm)  Weight (kg)         City
0    Alice  Female   25          165           58     New York
1      Bob    Male   30          180           80  Los Angeles
2  Charlie    Male   35          175           70      Chicago
3    Diana  Female   28          170           65        Miami
4      Eva  Female   27          175           60     New York
5    Frank    Male   40          190           85      Houston
6    Grace  Female   32          168           55      Chicago
7    Henry    Male   45          175           75  Los Angeles
8      Ivy  Female   26          172           63        Miami
9     Jack    Male   28          180           78     New York

In [4]:
df.head(5)

      Name  Gender  Age  Height (cm)  Weight (kg)         City
0    Alice  Female   25          165           58     New York
1      Bob    Male   30          180           80  Los Angeles
2  Charlie    Male   35          175           70      Chicago
3    Diana  Female   28          170           65        Miami
4      Eva  Female   27          175           60     New York

### 2. Print the number of rows and columns in the DataFrame.

In [5]:
df.shape

(10, 6)

### 3. Print the null value count

In [6]:
df.isnull().count()

Name           10
Gender         10
Age            10
Height (cm)    10
Weight (kg)    10
City           10
dtype: int64

### 4. Print the average age, height, and weight of the people in the DataFrame.

In [7]:
df['Age'].mean()

31.6

In [8]:
df['Height (cm)'].mean()

175.0

In [9]:
df['Weight (kg)'].mean()

68.9

### 5. Print the name and city of the person who is the tallest in the DataFrame.

In [10]:
df.nlargest(1, 'Height (cm)').max()

Name             Frank
Gender            Male
Age                 40
Height (cm)        190
Weight (kg)         85
City           Houston
dtype: object

### 6. Create a new column in the DataFrame called "BMI" that calculates the body mass index of each person. BMI is calculated as weight (kg) divided by height (m) squared. Print the DataFrame with the new column.

In [11]:
df['BMI']=df['Weight (kg)']/df['Height (cm)']**2

In [12]:
print(df)

      Name  Gender  Age  Height (cm)  Weight (kg)         City       BMI
0    Alice  Female   25          165           58     New York  0.002130
1      Bob    Male   30          180           80  Los Angeles  0.002469
2  Charlie    Male   35          175           70      Chicago  0.002286
3    Diana  Female   28          170           65        Miami  0.002249
4      Eva  Female   27          175           60     New York  0.001959
5    Frank    Male   40          190           85      Houston  0.002355
6    Grace  Female   32          168           55      Chicago  0.001949
7    Henry    Male   45          175           75  Los Angeles  0.002449
8      Ivy  Female   26          172           63        Miami  0.002130
9     Jack    Male   28          180           78     New York  0.002407

In [13]:
df

      Name  Gender  Age  Height (cm)  Weight (kg)         City       BMI
0    Alice  Female   25          165           58     New York  0.002130
1      Bob    Male   30          180           80  Los Angeles  0.002469
2  Charlie    Male   35          175           70      Chicago  0.002286
3    Diana  Female   28          170           65        Miami  0.002249
4      Eva  Female   27          175           60     New York  0.001959
5    Frank    Male   40          190           85      Houston  0.002355
6    Grace  Female   32          168           55      Chicago  0.001949
7    Henry    Male   45          175           75  Los Angeles  0.002449
8      Ivy  Female   26          172           63        Miami  0.002130
9     Jack    Male   28          180           78     New York  0.002407

### 7. Group the data by gender and print the average age, height, and weight of males and females separately.

In [15]:
g = df.groupby('Gender').mean()

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_23220\1790954923.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  g = df.groupby('Gender').mean()

In [16]:
g

         Age  Height (cm)  Weight (kg)       BMI
Gender
Female  27.6        170.0         60.2  0.002083
Male    35.6        180.0         77.6  0.002393

In [17]:
print(g[['Age', 'Height (cm)', 'Weight (kg)']])

         Age  Height (cm)  Weight (kg)
Gender
Female  27.6        170.0         60.2
Male    35.6        180.0         77.6

### 8. Sort the data by age in ascending order and print the first 3 rows of the sorted DataFrame.

In [18]:
df.sort_values('Age',ascending=False).head(3)

      Name Gender  Age  Height (cm)  Weight (kg)         City       BMI
7    Henry   Male   45          175           75  Los Angeles  0.002449
5    Frank   Male   40          190           85      Houston  0.002355
2  Charlie   Male   35          175           70      Chicago  0.002286

### 9. Filter the data to only include people who live in New York and print the resulting DataFrame.

In [19]:
city=df[df['City']=='New York']

In [20]:
city

    Name  Gender  Age  Height (cm)  Weight (kg)      City       BMI
0  Alice  Female   25          165           58  New York  0.002130
4    Eva  Female   27          175           60  New York  0.001959
9   Jack    Male   28          180           78  New York  0.002407